Revit 2027 API
SpacingRule.SetLayoutNone Method
Set the Layout property to None.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutNone()
Public Sub SetLayoutNone
public:
void SetLayoutNone()
member SetLayoutNone : unit -> unit
Remarks
No internal lines will be generated, but the effect is equivalent to having two lines, one at each end of the region.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace